КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыТоплива/КонтурЛогистика_ТипыТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыТоплива</name>
  <enumValues>
    <name>Biodiesel</name>
  </enumValues>
  <enumValues>
    <name>CompressedNaturalGas</name>
  </enumValues>
  <enumValues>
    <name>Diesel</name>
  </enumValues>
  <enumValues>
    <name>Electricity</name>
  </enumValues>
  <enumValues>
    <name>Gasoline</name>
  </enumValues>
  <enumValues>
    <name>LiquefiedPetroleumGas</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыТоплива/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеПоСтроке(Знач Значение) Экспорт
	
	ТекущееЗначение = НРег(Значение);
	Если ТекущееЗначение = "biodiesel" Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.Biodiesel;
		
	ИначеЕсли ТекущееЗначение = "compressednaturalgas" Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.CompressedNaturalGas;
		
	ИначеЕсли ТекущееЗначение = "diesel" Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.Diesel;
		
	ИначеЕсли ТекущееЗначение = "electricity" Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.Electricity;
		
	ИначеЕсли ТекущееЗначение = "gasoline" Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.Gasoline;
		
	ИначеЕсли ТекущееЗначение = "liquefiedpetroleumgas" Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.LiquefiedPetroleumGas;
		
	ИначеЕсли ТекущееЗначение = "other" Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.Other;
		
	Иначе
		
		ТекстОшибки = "Не удалось сконвертировать тип топлива: " + Значение;
		КонтурЛогистика_Метрика.ОбработатьОшибку("КонтурЛогистика_ТипыТоплива.ЗначениеПоСтроке", ТекстОшибки);
		
		Возврат Перечисления.КонтурЛогистика_ТипыТоплива.Other;
		
	КонецЕсли;
	
КонецФункции

Функция СтрокаПоЗначению(Знач Значение) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Biodiesel Тогда
		
		Возврат "Biodiesel";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.CompressedNaturalGas Тогда
		
		Возврат "CompressedNaturalGas";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Diesel Тогда
		
		Возврат "Diesel";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Electricity Тогда
		
		Возврат "Electricity";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Gasoline Тогда
		
		Возврат "Gasoline";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.LiquefiedPetroleumGas Тогда
		
		Возврат "LiquefiedPetroleumGas";
		
	Иначе
		
		Возврат "Other";
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеДляXDTO(Значение) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Biodiesel Тогда
		
		Результат = "6";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.CompressedNaturalGas Тогда
		
		Результат = "3";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Diesel Тогда
		
		Результат = "2";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Electricity Тогда
		
		Результат = "5";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.Gasoline Тогда
		
		Результат = "1";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТоплива.LiquefiedPetroleumGas Тогда
		
		Результат = "4";
		
	Иначе
		
		Результат = "7";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Значение) Экспорт
	
	Если Значение = "6" Тогда
		
		Результат = Перечисления.КонтурЛогистика_ТипыТоплива.Biodiesel;
		
	ИначеЕсли Значение = "3" Тогда
		
		Результат = Перечисления.КонтурЛогистика_ТипыТоплива.CompressedNaturalGas;
		
	ИначеЕсли Значение = "2" Тогда
		
		Результат = Перечисления.КонтурЛогистика_ТипыТоплива.Diesel;
		
	ИначеЕсли Значение = "5" Тогда
		
		Результат = Перечисления.КонтурЛогистика_ТипыТоплива.Electricity;
		
	ИначеЕсли Значение = "1" Тогда
		
		Результат = Перечисления.КонтурЛогистика_ТипыТоплива.Gasoline;
		
	ИначеЕсли Значение = "4" Тогда
		
		Результат = Перечисления.КонтурЛогистика_ТипыТоплива.LiquefiedPetroleumGas;
		
	Иначе
		
		Результат = Перечисления.КонтурЛогистика_ТипыТоплива.Other;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
